eboxmaker/eBox_Framework/mcuLib/N32G030/n32g030_std_periph_driver/inc/n32g030_rcc.h
/** @addtogroup LSE_configuration
 * @{
 */

#define RCC_LSE_DISABLE ((uint32_t)0x00000000)
#define RCC_LSE_ENABLE  ((uint32_t)0x00000004)
#define RCC_LSE_BYPASS  ((uint32_t)0x00000010)
#define IS_RCC_LSE(LSE) (((LSE) == RCC_LSE_DISABLE) || ((LSE) == RCC_LSE_ENABLE) || ((LSE) == RCC_LSE_BYPASS))
/**
 * @}
 */

/** @addtogroup RTC_clock_source
 * @{
 */

#define RCC_RTCCLK_SRC_NONE       ((uint32_t)0x00000000)
#define RCC_RTCCLK_SRC_LSE        ((uint32_t)0x00000020)
#define RCC_RTCCLK_SRC_LSI        ((uint32_t)0x00000040)
#define RCC_RTCCLK_SRC_HSE_DIV128 ((uint32_t)0x00000060)
#define IS_RCC_RTCCLK_SRC(SOURCE)                                                                                      \
    (((SOURCE) == RCC_RTCCLK_SRC_NONE) || ((SOURCE) == RCC_RTCCLK_SRC_LSE) || ((SOURCE) == RCC_RTCCLK_SRC_LSI)         \
  || ((SOURCE) == RCC_RTCCLK_SRC_HSE_DIV128))
/**
 * @}
 */

/** @addtogroup LPRUN_clock_source
 * @{
 */

#define RCC_LPRUNCLK_SRC_LSI        ((uint32_t)0x00000000)
#define RCC_LPRUNCLK_SRC_LSE        ((uint32_t)0x00000200)
#define IS_RCC_LPRUNCLK_SRC(SOURCE)                                                                                      \
    (((SOURCE) == RCC_LPRUNCLK_SRC_LSI) || ((SOURCE) == RCC_LPRUNCLK_SRC_LSE))
/**
 * @}
 */

/** @addtogroup TSC_clock_source
 * @{
 */

#define RCC_TSCCLK_SRC_LSI        ((uint32_t)0x00000000)
#define RCC_TSCCLK_SRC_LSE        ((uint32_t)0x00000400)
#define IS_RCC_TSCCLK_SRC(SOURCE)                                                                                      \
    (((SOURCE) == RCC_TSCCLK_SRC_LSI) || ((SOURCE) == RCC_TSCCLK_SRC_LSE))
/**
 * @}
 */

/** @addtogroup AHB_peripheral
 * @{
 */

#define RCC_AHB_PERIPH_DMA    ((uint32_t)0x00000001)
#define RCC_AHB_PERIPH_SRAM   ((uint32_t)0x00000004)
#define RCC_AHB_PERIPH_FLITF  ((uint32_t)0x00000010)
#define RCC_AHB_PERIPH_HSQRT  ((uint32_t)0x00000020)
#define RCC_AHB_PERIPH_CRC    ((uint32_t)0x00000040)
#define RCC_AHB_PERIPH_HDIV   ((uint32_t)0x00000080)
#define RCC_AHB_PERIPH_ADC    ((uint32_t)0x00001000)

#define IS_RCC_AHB_PERIPH(PERIPH) ((((PERIPH)&0xFFFFEF0A) == 0x00) && ((PERIPH) != 0x00))
#define IS_RCC_AHB_PERIPH_RESET(PERIPH) ((((PERIPH)&0xFFFFEF5F) == 0x00) && ((PERIPH) != 0x00))

/**
 * @}
 */

/** @addtogroup APB2_peripheral
 * @{
 */

#define RCC_APB2_PERIPH_AFIO   ((uint32_t)0x00000001)
#define RCC_APB2_PERIPH_GPIOA  ((uint32_t)0x00000004)
#define RCC_APB2_PERIPH_GPIOB  ((uint32_t)0x00000008)
#define RCC_APB2_PERIPH_GPIOC  ((uint32_t)0x00000010)
#define RCC_APB2_PERIPH_GPIOF  ((uint32_t)0x00000080)
#define RCC_APB2_PERIPH_SPI1   ((uint32_t)0x00000200)
#define RCC_APB2_PERIPH_SPI2   ((uint32_t)0x00000400)
#define RCC_APB2_PERIPH_TIM1   ((uint32_t)0x00001000)
#define RCC_APB2_PERIPH_TIM8   ((uint32_t)0x00002000)
#define RCC_APB2_PERIPH_USART1 ((uint32_t)0x00004000)

#define IS_RCC_APB2_PERIPH(PERIPH) ((((PERIPH)&0xFFFF8962) == 0x00) && ((PERIPH) != 0x00))
/**
 * @}
 */

/** @addtogroup APB1_peripheral
 * @{
 */

#define RCC_APB1_PERIPH_TIM3      ((uint32_t)0x00000002)
#define RCC_APB1_PERIPH_LPTIMPCLK ((uint32_t)0x00000004)
#define RCC_APB1_PERIPH_LPTIM     ((uint32_t)0x00000008)
#define RCC_APB1_PERIPH_TIM6      ((uint32_t)0x00000010)
#define RCC_APB1_PERIPH_BEEP      ((uint32_t)0x00000020)
#define RCC_APB1_PERIPH_COMP      ((uint32_t)0x00000100)
#define RCC_APB1_PERIPH_COMPFILT  ((uint32_t)0x00000200)
#define RCC_APB1_PERIPH_WWDG      ((uint32_t)0x00000800)
#define RCC_APB1_PERIPH_USART2    ((uint32_t)0x00020000)
#define RCC_APB1_PERIPH_LPUART    ((uint32_t)0x00040000)
#define RCC_APB1_PERIPH_I2C1      ((uint32_t)0x00200000)
#define RCC_APB1_PERIPH_I2C2      ((uint32_t)0x00400000)
#define RCC_APB1_PERIPH_PWR       ((uint32_t)0x10000000)
#define RCC_APB1_PERIPH_OPAMP     ((uint32_t)0x80000000)

#define IS_RCC_APB1_PERIPH(PERIPH) ((((PERIPH)&0x6F99F4C1) == 0x00) && ((PERIPH) != 0x00))
#define IS_RCC_APB1_PERIPH_RESET(PERIPH) ((((PERIPH)&0xEF99F7C5) == 0x00) && ((PERIPH) != 0x00))

/**
 * @}
 */
 
/** @addtogroup LPTIM
 * @{
 */
#define RCC_LPTIMCLK_SRC_MASK  ((uint32_t)0xFF1FFFFF)

#define RCC_LPTIMCLK_SRC_APB1  ((uint32_t)0x00000000)
#define RCC_LPTIMCLK_SRC_HSI   ((uint32_t)0x00200000)
#define RCC_LPTIMCLK_SRC_HSE   ((uint32_t)0x00400000)
#define RCC_LPTIMCLK_SRC_LSI   ((uint32_t)0x00600000)
#define RCC_LPTIMCLK_SRC_LSE   ((uint32_t)0x00800000)
#define RCC_LPTIMCLK_SRC_COMP1 ((uint32_t)0x00A00000)

#define IS_RCC_LPTIM_CLK(LPTIMCLK)                                                            \
        (((LPTIMCLK) == RCC_LPTIMCLK_SRC_APB1) || ((LPTIMCLK) == RCC_LPTIMCLK_SRC_HSI)        \
      || ((LPTIMCLK) == RCC_LPTIMCLK_SRC_HSE)  || ((LPTIMCLK) == RCC_LPTIMCLK_SRC_LSI)        \
      || ((LPTIMCLK) == RCC_LPTIMCLK_SRC_LSE)  || ((LPTIMCLK) == RCC_LPTIMCLK_SRC_COMP1))

/**
 * @}
 */
 
/** @addtogroup LPUART
 * @{
 */

#define RCC_LPUARTCLK_SRC_MASK    ((uint32_t)0xF1FFFFFF)

#define RCC_LPUARTCLK_SRC_APB1    ((uint32_t)0x00000000)
#define RCC_LPUARTCLK_SRC_SYSCLK  ((uint32_t)0x00000001)
#define RCC_LPUARTCLK_SRC_HSI     ((uint32_t)0x00000002)
#define RCC_LPUARTCLK_SRC_HSE     ((uint32_t)0x00000003)
#define RCC_LPUARTCLK_SRC_LSI     ((uint32_t)0x00000004)
#define RCC_LPUARTCLK_SRC_LSE     ((uint32_t)0x00000005)

#define IS_RCC_LPUART_CLK(LPUARTCLK) (((LPUARTCLK) <= RCC_LPUARTCLK_SRC_LSE))

/**
 * @}
 */
 
#define RCC_MCO_CLK_DIV2  ((uint32_t)0x20000000)
#define RCC_MCO_CLK_DIV3  ((uint32_t)0x30000000)
#define RCC_MCO_CLK_DIV4  ((uint32_t)0x40000000)
#define RCC_MCO_CLK_DIV5  ((uint32_t)0x50000000)
#define RCC_MCO_CLK_DIV6  ((uint32_t)0x60000000)
#define RCC_MCO_CLK_DIV7  ((uint32_t)0x70000000)
#define RCC_MCO_CLK_DIV8  ((uint32_t)0x80000000)
#define RCC_MCO_CLK_DIV9  ((uint32_t)0x90000000)
#define RCC_MCO_CLK_DIV10 ((uint32_t)0xA0000000)
#define RCC_MCO_CLK_DIV11 ((uint32_t)0xB0000000)
#define RCC_MCO_CLK_DIV12 ((uint32_t)0xC0000000)
#define RCC_MCO_CLK_DIV13 ((uint32_t)0xD0000000)
#define RCC_MCO_CLK_DIV14 ((uint32_t)0xE0000000)
#define RCC_MCO_CLK_DIV15 ((uint32_t)0xF0000000)
#define IS_RCC_MCOCLKPRE(DIV)                                                                              \
       (((DIV) == RCC_MCO_CLK_DIV2)  || ((DIV) == RCC_MCO_CLK_DIV3)                                        \
     || ((DIV) == RCC_MCO_CLK_DIV4)  || ((DIV) == RCC_MCO_CLK_DIV5)  || ((DIV) == RCC_MCO_CLK_DIV6)        \
     || ((DIV) == RCC_MCO_CLK_DIV7)  || ((DIV) == RCC_MCO_CLK_DIV8)  || ((DIV) == RCC_MCO_CLK_DIV9)        \
     || ((DIV) == RCC_MCO_CLK_DIV10) || ((DIV) == RCC_MCO_CLK_DIV11) || ((DIV) == RCC_MCO_CLK_DIV12)       \
     || ((DIV) == RCC_MCO_CLK_DIV13) || ((DIV) == RCC_MCO_CLK_DIV14) || ((DIV) == RCC_MCO_CLK_DIV15))

/** @addtogroup Clock_source_to_output_on_MCO_pin
 * @{
 */

#define RCC_MCO_NOCLK       ((uint8_t)0x00)
#define RCC_MCO_LSI         ((uint8_t)0x01)
#define RCC_MCO_LSE         ((uint8_t)0x02)
#define RCC_MCO_SYSCLK      ((uint8_t)0x03)
#define RCC_MCO_HSI         ((uint8_t)0x04)
#define RCC_MCO_HSE         ((uint8_t)0x05)
#define RCC_MCO_PLLCLK_PRES ((uint8_t)0x06)

